app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(email: session_params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'kixaduff@gmail.com' LIMIT 1